Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HID_Host/Src/USB_HID_Host.c
void USB_HID_Host___Close_HID_Interface(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *		p_HID_Node				= USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	uint8_t 										configuration_Number	= USB_Host_Device_Manager___Get_Device_Current_Configuration_Number(port_Number, device_Address);

	for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
	{
		if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i] != NULL)
		{
			USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Disconnected_Callback[i](port_Number, device_Address, interface_Number);
		}
	}

	USB_Host_Device_Manager___Remove_Interface_Polling_Process(port_Number, device_Address, configuration_Number ,interface_Number);
	USB_HID_Host___Delete_HID_Node(port_Number, p_HID_Node);
}

void USB_HID_Host___HID_Interface_Disconnected_Callback(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Number, uint8_t interface_Number)
{
	USB_HID_Host___Close_HID_Interface(port_Number, device_Address, interface_Number);
}

void USB_HID_Host___URB_Setup_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS);

void USB_HID_Host___Get_HID_Report_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint16_t length, uint8_t* p_Buffer, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_STANDARD_INTERFACE_TO_HOST;
	setup_Packet.bRequest 		= USB_Host_Transfers___CONTROL_SETUP_PACKET_BREQUEST_GET_DESCRIPTOR;
	setup_Packet.wValue 		= 0x2200;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= length;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_IN, setup_Packet, p_Buffer, length, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Get_HID_Descriptor(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint16_t length, uint8_t* p_Buffer, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_STANDARD_INTERFACE_TO_HOST;
	setup_Packet.bRequest 		= USB_Host_Transfers___CONTROL_SETUP_PACKET_BREQUEST_GET_DESCRIPTOR;
	setup_Packet.wValue 		= 0x2100;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= length;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_IN, setup_Packet, p_Buffer, length, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Set_Protocol_Transfer(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t protocol, void callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS))
{
	USB_Host_Transfers___Control_Setup_Packet_TypeDef setup_Packet;
	setup_Packet.bmRequestType 	= USB_Host_Transfers___CONTROL_SETUP_PACKET_BMREQUESTTYPE_CLASS_HOST_TO_INTERFACE;
	setup_Packet.bRequest 		= USB_HID_Host___bRequest_SET_PROTOCOL;
	setup_Packet.wValue 		= protocol;
	setup_Packet.wIndex 		= interface_Number;
	setup_Packet.wLength 		= 0;

	USB_Host_Transfers___Control_Transfer(port_Number, device_Address, USB_Host___ENDPOINT_ZERO, USB_Host___TRANSFER_DIRECTION_OUT, setup_Packet, 0, 0, USB_HID_Host___STANDARD_NUMBER_OF_RETRIES, callback);
}

void USB_HID_Host___Calculate_Report_Size(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	USB_HID_Host___HID_Interface_TypeDef* p_HID_Interface = &p_HID_Node->HID_Device;

	if(p_HID_Interface->current_Protocol == USB_HID_Host___PROTOCOL_BOOT_MODE)
	{
		if (p_HID_Interface->device_Type == USB_HID_Host___DEVICE_TYPE_KEYBOARD)
		{
			p_HID_Interface->HID_IN_Report_Size = USB_HID_Host___REPORT_SIZE_BOOT_KEYBOARD;
		}
		else if (p_HID_Interface->device_Type == USB_HID_Host___DEVICE_TYPE_MOUSE)
		{
			p_HID_Interface->HID_IN_Report_Size = USB_HID_Host___REPORT_SIZE_BOOT_MOUSE;
		}
	}
	else
	{
		// calculate from report descriptor
	}
}

void USB_HID_Host___URB_Set_Protocol_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS)
{
	if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_SUCCESS)
	{
		USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);

		if(p_HID_Node != NULL)
		{
			p_HID_Node->HID_Device.current_Protocol = URB.control_Setup_Packet.wValue;

			USB_HID_Host___Calculate_Report_Size(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);

			if(p_HID_Node->HID_Device.set_Protocol_Callback != NULL)
			{
				p_HID_Node->HID_Device.set_Protocol_Callback(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);
			}
		}
	}
	else
	{
		// delete node, end device
	}
}

void USB_HID_Host___Set_Protocol(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t protocol, void callback(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number))
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	p_HID_Node->HID_Device.set_Protocol_Callback = callback;
	USB_HID_Host___Set_Protocol_Transfer(port_Number, device_Address, interface_Number, protocol, USB_HID_Host___URB_Set_Protocol_Callback);
}

void USB_HID_Host___Interrupt_URB_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_IN_Endpoint(URB.port_Number, URB.device_Address, URB.endpoint_Number);

	if(p_HID_Node != NULL)
	{
		if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_SUCCESS)
		{
			p_HID_Node->HID_Device.subsequent_Transfer_Error_Count = 0;

			if (p_HID_Node->HID_Device.report_Callback != NULL)
			{
				p_HID_Node->HID_Device.report_Callback(URB.port_Number, URB.device_Address, p_HID_Node->HID_Device.interface_Number, URB.transfer_Buffer, URB.transfer_Length);
			}

			/*printf("Received report: ");
			for(uint32_t i = 0; i < URB.transfer_Length; i++)
			{
				printf("%d ", (int8_t)URB.transfer_Buffer[i]);
			}
			printf("\n");*/

