Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HID_Host/Src/USB_HID_Host.c
		}
		else if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_NAK)
		{
			p_HID_Node->HID_Device.subsequent_Transfer_Error_Count = 0;
		}
		else if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_ERROR)
		{
			p_HID_Node->HID_Device.subsequent_Transfer_Error_Count++;
			if (p_HID_Node->HID_Device.subsequent_Transfer_Error_Count > USB_HID_Host___MAX_SUBSEQUENT_TRANSFER_ERRORS)
			{
				printf("Too many subsequent transfer errors\n");

				USB_HID_Host___Close_HID_Interface(p_HID_Node->HID_Device.port_Number, p_HID_Node->HID_Device.device_Address, p_HID_Node->HID_Device.interface_Number);
			}
		}
	}
}

void USB_HID_Host___Polling_Callback(uint8_t port_Number, void* context)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *p_HID_Node = (USB_HID_Host___HID_Interface_Node_TypeDef*)context;
	uint8_t odd_Frame = USB_Host___Get_Frame_Number(port_Number) %2;
	USB_Host_Transfers___Interrupt_Transfer(port_Number, p_HID_Node->HID_Device.device_Address, p_HID_Node->HID_Device.interrupt_In_Endpoint_Number, USB_Host_Transfers___URB_DIRECTION_IN, p_HID_Node->HID_Device.HID_Report_Buffer, p_HID_Node->HID_Device.HID_IN_Report_Size, 0, odd_Frame, 1, USB_HID_Host___Interrupt_URB_Callback);
}

void USB_HID_Host___Start_Reporting(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, void callback(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number, uint8_t* report_Buffer, uint16_t report_Length))
{
	USB_HID_Host___HID_Interface_Node_TypeDef *p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);

	uint8_t polling_Interval = p_HID_Node->HID_Device.interrupt_In_Endpoint_Interval;
	p_HID_Node->HID_Device.report_Callback = callback;

	USB_Host_Device_Manager___Add_Interface_Polling_Process(p_HID_Node->HID_Device.port_Number, p_HID_Node->HID_Device.device_Address, USB_Host_Device_Manager___Get_Device_Current_Configuration_Number(p_HID_Node->HID_Device.port_Number, p_HID_Node->HID_Device.device_Address), p_HID_Node->HID_Device.interface_Number, polling_Interval, (void*)p_HID_Node, USB_HID_Host___Polling_Callback);
}

uint8_t USB_HID_Host___Is_Interface_Registered(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef *p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);
	return(p_HID_Node->HID_Device.HID_Descriptor.interface_Registered);
}

void USB_HID_Host___Do_Setup_Stage(USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node)
{
	uint8_t port_Number 		= p_HID_Node->HID_Device.port_Number;
	uint8_t device_Address	 	= p_HID_Node->HID_Device.device_Address;
	uint8_t interface_Number 	= p_HID_Node->HID_Device.interface_Number;

	switch(p_HID_Node->HID_Device.setup_Stage)
	{
	case USB_HID_Host___SETUP_STAGE_GET_HID_REPORT_DESCRIPTOR:
		{
			uint16_t 	report_Descriptor_Length = p_HID_Node->HID_Device.HID_Descriptor.wDescriptorLength;
			uint8_t* 	report_Descriptor_Buffer = p_HID_Node->HID_Device.HID_Report_Descriptor_Buffer;

			USB_HID_Host___Get_HID_Report_Descriptor(port_Number, device_Address, interface_Number, report_Descriptor_Length, report_Descriptor_Buffer, USB_HID_Host___URB_Setup_Callback);
			break;
		}

	case USB_HID_Host___SETUP_STAGE_NOTIFY_APPLICATIONS:
		{
			for (uint8_t i = 0; i < USB_HID_Host___MAX_APPLICATIONS; i++)
			{
				if (USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i] != NULL)
				{
					USB_HID_Host___Application_Callbacks[port_Number].HID_Interface_Connected_Callback[i](port_Number, device_Address, interface_Number);
				}
			}

			if(USB_HID_Host___Is_Interface_Registered(port_Number, device_Address, interface_Number) == false)
			{
				printf("Device not registered so it was deleted\n");
				USB_HID_Host___Close_HID_Interface(port_Number, device_Address, interface_Number);
			}

			break;
		}
	}
}

void USB_HID_Host___Set_Next_Setup_Stage(USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node)
{
	switch(p_HID_Node->HID_Device.setup_Stage)
	{
	case USB_HID_Host___SETUP_STAGE_GET_HID_DESCRIPTOR:
		p_HID_Node->HID_Device.setup_Stage = USB_HID_Host___SETUP_STAGE_GET_HID_REPORT_DESCRIPTOR;
		break;
	case USB_HID_Host___SETUP_STAGE_GET_HID_REPORT_DESCRIPTOR:
		p_HID_Node->HID_Device.setup_Stage = USB_HID_Host___SETUP_STAGE_NOTIFY_APPLICATIONS;
		//USB_HID_Host___Print_HID_Report_Descriptor(p_HID_Node);
		break;
	}
}

void USB_HID_Host___URB_Setup_Callback(USB_Host_Transfers___URB_CALLBACK_PARAMETERS)
{
	if(URB.transfer_Status == USB_Host_Transfers___URB_STATUS_SUCCESS)
	{
		USB_HID_Host___HID_Interface_Node_TypeDef* p_HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(URB.port_Number, URB.device_Address, URB.control_Setup_Packet.wIndex);
		if(p_HID_Node != NULL)
		{
			USB_HID_Host___Set_Next_Setup_Stage(p_HID_Node);
			USB_HID_Host___Do_Setup_Stage(p_HID_Node);
		}
	}
	else
	{
		// delete node, end device
	}
}

void USB_HID_Host___Setup_HID_Interface(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Number, uint8_t interface_Number, uint8_t boot_Mode_Supported, uint8_t device_Type)
{
	USB_Host_Device_Manager___Set_Interface_Disconnected_Callback(port_Number, device_Address, configuration_Number, interface_Number, USB_HID_Host___HID_Interface_Disconnected_Callback);

	USB_HID_Host___HID_Interface_Node_TypeDef* 	HID_Node 	= USB_HID_Host___Create_HID_Node(port_Number);
	USB_HID_Host___HID_Interface_TypeDef* 	HID_Interface 	= &HID_Node->HID_Device;

	HID_Interface->port_Number				= port_Number;
	HID_Interface->device_Address 			= device_Address;
	HID_Interface->interface_Number			= interface_Number;
	HID_Interface->boot_Mode_Supported		= boot_Mode_Supported;
	HID_Interface->device_Type				= device_Type;
	HID_Interface->setup_Stage				= 0;

	uint8_t num_Endpoints 				= (USB_Host_Device_Manager___Device_Get_Interface_Descriptor(port_Number, device_Address, configuration_Number, interface_Number)).bNumEndpoints;

	for(uint8_t endpoint_Descriptor_Number = 0; endpoint_Descriptor_Number < num_Endpoints; endpoint_Descriptor_Number++)
	{
		USB_Host___Endpoint_Descriptor_TypeDef endpoint_Descriptor = USB_Host_Device_Manager___Device_Get_Endpoint_Descriptor(port_Number, device_Address, configuration_Number, interface_Number, endpoint_Descriptor_Number);

		if((endpoint_Descriptor.bEndpointAddress >> 7) == 1)
		{
			HID_Interface->interrupt_In_Endpoint_Number 	= endpoint_Descriptor.bEndpointAddress & 0x7f;
			HID_Interface->interrupt_In_Endpoint_Interval 	= endpoint_Descriptor.bInterval;
		}
		else
		{
			HID_Interface->interrupt_Out_Endpoint_Number 	= endpoint_Descriptor.bEndpointAddress & 0x7f;
			HID_Interface->interrupt_Out_Endpoint_Interval = endpoint_Descriptor.bInterval;
		}
	}

	USB_HID_Host___Get_HID_Descriptor(port_Number, device_Address, interface_Number, USB_HID_Host___HID_Descriptor_Base_Length, (uint8_t*)&(HID_Interface->HID_Descriptor), USB_HID_Host___URB_Setup_Callback);
}

void USB_HID_Host___Setup_HID_Device(uint8_t port_Number, uint8_t device_Address)
{
	uint8_t 										current_Configuration_Number	= USB_Host_Device_Manager___Get_Device_Current_Configuration_Number(port_Number, device_Address);
	if(current_Configuration_Number > 0)
	{
		USB_Host___Device_Descriptor_TypeDef			device_Descriptor				= USB_Host_Device_Manager___Device_Get_Device_Descriptor(port_Number, device_Address);
		USB_Host___Configuration_Descriptor_TypeDef 	configuration_Descriptor 		= USB_Host_Device_Manager___Device_Get_Configuration_Descriptor(port_Number, device_Address, current_Configuration_Number);

		if(device_Descriptor.bDeviceClass == USB_HID_Host___COMPOSITE_DEVICE_CLASS)
		{
			for(uint8_t i = 0; i < configuration_Descriptor.bNumInterfaces; i++)
			{
				USB_Host___Interface_Descriptor_TypeDef 	interface_Descriptor 		= USB_Host_Device_Manager___Device_Get_Interface_Descriptor(port_Number, device_Address, current_Configuration_Number, i);

				if(interface_Descriptor.bInterfaceClass == USB_HID_Host___HID_INTERFACE_CLASS)
				{
					USB_HID_Host___Setup_HID_Interface(port_Number, device_Address, current_Configuration_Number, i, interface_Descriptor.bInterfaceSubClass, interface_Descriptor.bInterfaceProtocol);
				}
			}
		}
	}
}

uint8_t USB_HID_Host___Register_Interface(uint8_t port_Number, uint8_t device_Address, uint8_t interface_Number)
{
	USB_HID_Host___HID_Interface_Node_TypeDef* HID_Node = USB_HID_Host___Get_HID_Node_From_Device_Interface(port_Number, device_Address, interface_Number);

	if (HID_Node != NULL)
	{
		if (HID_Node->HID_Device.HID_Descriptor.interface_Registered == false)
		{
			HID_Node->HID_Device.HID_Descriptor.interface_Registered = true;
			return (EXIT_SUCCESS);
		}
		return (EXIT_SUCCESS);
	}

